live-load-test.yml
config:
  target: "https://youtube-k7zk.onrender.com"

  phases:
    - duration: 30
      arrivalRate: 2
      name: "Warm Up"

    - duration: 60
      arrivalRate: 5
      name: "Normal Traffic"

    - duration: 60
      arrivalRate: 10
      name: "Peak Traffic"

  payload:
    path: "./users.csv"
    fields:
      - email
      - password

  defaults:
    headers:
      x-load-test-key: "waifuTesting123"

scenarios:
  - name: "Live Stream Viewer Journey"

    flow:

      - post:
          url: "/api/v1/users/login"

          json:
            email: "{{ email }}"
            password: "{{ password }}"

      - get:
          url: "/api/v1/live/69fb35bdbee7327b3a4acafd"

      - get:
          url: "/api/v1/live/get-token/69fb35bdbee7327b3a4acafd"

      - think: 60

      - post:
          url: "/api/v1/users/logout"