load-test.yml
config:
  target: "https://youtube-k7zk.onrender.com"

  phases:
    - duration: 10
      arrivalRate: 100
      name: "100 RPS"

    - duration: 10
      arrivalRate: 200
      name: "200 RPS"

    - duration: 10
      arrivalRate: 300
      name: "300 RPS"

    - duration: 10
      arrivalRate: 500
      name: "500 RPS"

scenarios:
  - name: "Cached Video Stress Test"

    flow:
      - get:
          url: "/api/v1/videos/69fb35bdbee7327b3a4acafd"

          headers:
            Authorization: "Bearer {{ $processEnvironment.LOAD_TEST_ACCESS_TOKEN }}"
            x-load-test-key: "{{ $processEnvironment.LOAD_TEST_SECRET }}"