load-test.yml
config:
  version: "2"
  target: "https://youtube-k7zk.onrender.com"
  
  http:
    timeout: 30

  phases:
    - duration: 45
      arrivalRate: 1
      name: "Gentle Awakening"
    - duration: 60
      arrivalRate: 2
      name: "Light Load Assessment"

  payload:
    path: "./users.csv"
    fields:
      - "email"
      - "password"
    order: sequence

scenarios:
  - name: "Watch Video Journey"
    flow:
      # 1. Login
      - post:
          url: "/api/v1/users/login"
          json:
            email: "{{ email }}"
            password: "{{ password }}"
          capture:
            - header: "set-cookie"
              as: "authCookie"

      # 2. Get Homepage Videos
      - get:
          url: "/api/v1/videos"
          headers:
            Cookie: "{{ authCookie }}"

      # 3. Watch Video
      - get:
          url: "/api/v1/videos/69fb35bdbee7327b3a4acafd"
          headers:
            Cookie: "{{ authCookie }}"

      # 4. Simulate watching
      - think: 3

      # 5. Logout
      - post:
          url: "/api/v1/users/logout"
          headers:
            Cookie: "{{ authCookie }}"